docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-16 Wed 11:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSCE 990 (Spring 2021): Ensuring Software Dependability (or Software Verification)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu H. Nguyen" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CSCE 990 (Spring 2021): Ensuring Software Dependability (or Software Verification)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org58ad23a">Description</a></li>
<li><a href="#org32f4ba2">Grading</a>
<ul>
<li><a href="#orgdc01f5d">Reading (Schedule and Assignments)</a></li>
<li><a href="#org70da793">Porject (Project Info)</a>
<ul>
<li><a href="#orgb485cc0">Proposal</a></li>
<li><a href="#org6c267a7">Report</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org290c029">Course Policy</a></li>
<li><a href="#org89c075c">Acknowledgements</a></li>
<li><a href="#orgbcc31a5">Links</a></li>
</ul>
</div>
</div>
<pre class="example">
Meetings: TR 11:00AM - 11:15PM,  ZOOM

Instructor: ThanhVu Nguyen
Email: tnguyen@unl.edu
Office Hours: After class
</pre>

<div id="outline-container-org58ad23a" class="outline-2">
<h2 id="org58ad23a">Description</h2>
<div class="outline-text-2" id="text-org58ad23a">
<p>
This special topics course is a research seminar in <b>software verification and analysis</b>. 
The course covers on active research areas in programming languages 
and software engineering, but the specific topics will be largely 
determined by a combination of instructor fiat and the interests of the students.
We also focus on the <b>applications</b> of these techniques, 
i.e., the uses of software testing and verification techniques 
in emergining computing domains such as Machine Learning, IoT, and Robotics.
</p>
</div>
</div>

<div id="outline-container-org32f4ba2" class="outline-2">
<h2 id="org32f4ba2">Grading</h2>
<div class="outline-text-2" id="text-org32f4ba2">
<p>
You will be evaluated based on discussion and writting summaries on reading assignments, and completing a final project.
</p>
</div>

<div id="outline-container-orgdc01f5d" class="outline-3">
<h3 id="orgdc01f5d">Reading (<a href="assignments.html">Schedule and Assignments</a>)</h3>
<div class="outline-text-3" id="text-orgdc01f5d">
<p>
We will read papers covering various topics including model checking, symbolic and concolic executions, 
constraint solving (e.g., SMT solvers), interactive theorem proving, 
automatic debugging, invariant generation (dynamic vs static analyses), automatic program repair, 
program synthesis (e.g., syntax-guided synthesis).
We will also read papers that apply these techniques in practice (e.g., testing and verifying a Deep Neural Network or 
infering properties of an IoT system).
</p>

<p>
On average, we will discuss <b><b>three papers</b></b> a week (~50 minutes to each paper). 
You are responsible for reading at least <b><b>two papers</b></b> in advance for any given discussion.
</p>

<p>
At the beginning of each paper discussion I will choose up to <b>three students</b> at random. 
Each student will give a <b>five-minute</b> presentation about the paper.  
This presentation must includes:
</p>

<ol class="org-ol">
<li>the problem (what is it? why is it interesting?)</li>
<li>existing approaches (what are they? what are their limitations?)</li>
<li>the proposed technical approach (also talk about the strengths of approach and how the approach addresses the weaknesses of existing works)</li>
<li>limitations of the proposed approach and lists ways in which it might be improved.</li>
</ol>

<p>
You can also include other information, such as your opinion about the work, or its relation to other work you may know.
The goals of this approach are to encourage all participants to read the material thoroughly in advance, to provide jumping-off points for detailed discussions, and to allow me to evaluate participation.
</p>

<p>
In addition, these students will help engage discussions about the paper.
</p>
</div>
</div>


<div id="outline-container-org70da793" class="outline-3">
<h3 id="org70da793">Porject (<a href="project.html">Project Info</a>)</h3>
<div class="outline-text-3" id="text-org70da793">
</div>
<div id="outline-container-orgb485cc0" class="outline-4">
<h4 id="orgb485cc0">Proposal</h4>
<div class="outline-text-4" id="text-orgb485cc0">
<p>
By the end of the 3th week, submit a project proposal (1-2 page) that explains what you want to do and what you expect to learn from the project (i.e., why is it interesting to you?).
</p>

<p>
In addition, include:
</p>

<ol class="org-ol">
<li>A survey of the work in selected topic (e.g., read 3 papers thoroughly and 3 other papers superficially).</li>
<li>A work schedule. Make sure to budget time for writing a short project paper describing the project described below.</li>
</ol>
</div>
</div>

<div id="outline-container-org6c267a7" class="outline-4">
<h4 id="org6c267a7">Report</h4>
<div class="outline-text-4" id="text-org6c267a7">
<p>
Submit a project report (5-7 pages) during dead week (<b>11:59 PM Sunday</b>).
</p>

<p>
You will write the report as if you were submitting to a conference such as PLDI or FSE (e.g., using LaTeX templates for these conferences and including all the usual sections such as Introduction, Body, Related Work, Conclusion).
Turn in the complete PDF as well as your LaTeX source.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-org290c029" class="outline-2">
<h2 id="org290c029">Course Policy</h2>
<div class="outline-text-2" id="text-org290c029">
<ul class="org-ul">
<li>It is CSE Department policy that all students in CSE courses are expected to regularly check their email so they do not miss important announcements.</li>

<li>All homework assignments, quizzes, exams, etc. must be your own work. No direct collaboration with fellow students, past or current, is allowed unless otherwise stated. The Computer Science &amp; Engineering department has an <a href="https://cse.unl.edu/academic-integrity-policy">Academic Integrity Policy</a>. All students enrolled in any computer science course are bound by this policy. You are expected to read, understand, and follow this policy. Violations will be dealt with on a case by case basis and may result in a failing assignment or a failing grade for the course itself.</li>

<li>The CSE Department has an <a href="https://cse.unl.edu/contact-form">anonymous contact form</a> that you may use to voice your concerns about any problems in the course or department if you do not wish to be identified.</li>

<li>Consider the <a href="http://cse.unl.edu/src">Student Resource Center</a> in Avery 12 for additional help (e.g., TA's, tutorings, etc)</li>

<li>Students with disabilities are encouraged to contact the instructor for a confidential discussion of their individual needs for academic accommodation. It is the policy of the University of Nebraska-Lincoln to provide flexible and individualized accommodations to students with documented disabilities that may affect their ability to fully participate in course activities or to meet course requirements. To receive accommodation services, students must be registered with the Services for Students with Disabilities (SSD) office, 132 Canfield Administration, 472-3787 voice or TTY.</li>
</ul>
</div>
</div>

<div id="outline-container-org89c075c" class="outline-2">
<h2 id="org89c075c">Acknowledgements</h2>
<div class="outline-text-2" id="text-org89c075c">
<p>
Thanks <a href="https://web.eecs.umich.edu/~weimerw/">Westley Weimer</a> for letting me reuse and adapt course materials from his graduate PL seminar courses.
</p>
</div>
</div>


<div id="outline-container-orgbcc31a5" class="outline-2">
<h2 id="orgbcc31a5">Links</h2>
<div class="outline-text-2" id="text-orgbcc31a5">
<ul class="org-ul">
<li><a href="assignments.html">Schedule and Assignments</a></li>
<li><a href="project.html">Project Info</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
